json = {};

FS = FileStream;

path = 'sdcard/채팅욕';

Ll = '⎼'.repeat(40);

Lw = '\u200b'.repeat(500);

var 목록 = [];

var 보냄 = [];

rooms = [];

admins = [];

clearOwner = ['닉네임'];

const words = [
  'ㅂㅅ',
  'ㅅㅂ',
  'ㅗ',
  'ㅈ같',
  '간나새',
  '간나색',
  '개간나',
  '개간년',
  '개객기',
  '개객끼',
  '개갞',
  '개깩기',
  '개년',
  '개놈새',
  '개놈시키',
  '개뇬',
  '개독',
  '개새끼',
  '개색이',
  '개색히',
  '개샛',
  '개솔',
  '개쌍',
  '개쌍도',
  '개썅',
  '개자슥',
  '개좃',
  '개좆',
  '개지랄',
  '넌씨눈',
  '년놈',
  '뇬아',
  '뇬이',
  '느금마',
  '니기미',
  '니미럴',
  '니애미',
  '니애비',
  '니좆',
  '등시나',
  '똘추',
  '랄지',
  '매국노',
  '머저리',
  '뭔개솔',
  '미췬놈',
  '미치광이',
  '미친개',
  '미친넘',
  '미친년',
  '미친놈',
  '미친새끼',
  '미칫나',
  '미틴넘',
  '미틴년',
  '미틴놈',
  '발년',
  '발놈',
  '발련',
  '뱡신',
  '버러지',
  '벅큐',
  '벌레새끼',
  '변태새끼',
  '볍신',
  '병시',
  '병시나',
  '병신',
  '보지년',
  '뵹신',
  '불여시',
  '붕시나',
  '붕신',
  '븅딱',
  '븅시나',
  '븅신',
  '비융신',
  '빙신',
  '빡대가리',
  '빡대갈',
  '빡큐',
  '빨통',
  '쁑신',
  '상년',
  '새대가리',
  '샹년',
  '샹놈',
  '샹뇬',
  '섹도시발',
  '시바라',
  '시부랄',
  '시부럴',
  '식빵새끼',
  '십장생',
  '십창',
  '십파',
  '싶파',
  '싸가지',
  '쌍간나',
  '쌍년',
  '쌍놈',
  '쌍눔',
  '쌍욕',
  '쌥새',
  '썅',
  '썅년',
  '썅놈',
  '썅뇬',
  '써글년',
  '써글놈',
  '쓰브랄',
  '씨부랄',
  '씨부럴',
  '씨부려',
  '씨부리',
  '씹새',
  '씹창',
  '앰창',
  '언년이',
  '엄창',
  '엠병',
  '엠생',
  '엠창',
  '염병',
  '옘병',
  '우라질',
  '육갑떨',
  '육갑하',
  '육시럴',
  '이년',
  '이뇬',
  '인간말종',
  '인간쓰레기',
  '잡년',
  '잡놈',
  '잦같',
  '저년',
  '졎같',
  '조깡',
  '족깐나',
  '족바리',
  '좃까',
  '좃도',
  '좃됨',
  '좃만',
  '좃망',
  '좃밥',
  '종간나',
  '좆간나',
  '좆중고딩',
  '줮같',
  '지기미',
  '창놈',
  '피융신',
  '화냥년',
  '환향년',
  '후레자식',
  '몸파는',
  '쌍넌',
  '아괄',
  '썩을눔',
  '성감대',
  '성경험',
  '싀벌',
  '배때지',
  '스뎅',
  '쌍늠',
  '강간',
  '섹하구',
  '아구지',
  '싀발',
  '뒤질',
  '느그애미',
  '빙딱',
  '싀봉',
  '주둥아리',
  '쌍너엄',
  '씌펄',
  '쌍뇬',
  '아가리',
  '썅눔',
  '빠구뤼',
  '스펄',
  '니미',
  '쉬파',
  '썩을뇬',
  '빙삼',
  '개쌔끼',
  '스벌',
  '씌바',
  '딸딸',
  '써글',
  '씌박',
  '개자석',
  '쌍녀언',
  '개뼉다구',
  '상놈',
  '아굴창',
  '앰뒤',
  '사까쉬',
  '쉬뻘',
  '대갈통',
  '싸까시',
  '섹하고',
  '쉬펄',
  '씌뻘',
  '개미친',
  '아구리',
  '대굴빡',
  '씌블',
  '섹하장',
  '쉬팍',
  '새뀌',
  '썩을늠',
  '매춘',
  '뽀오지',
  '쉬퐁',
  '썩을넘',
  '씨발',
  '니엄마',
  '스트립',
  '느그엄마',
  '씌빌',
  '씌파',
  '씨1발',
  '싀팍',
  '자쥐',
  '대가리',
  '썅넘',
  '씌퐝',
  '대갈',
  '씌불',
  '씌팔',
  '븅쉰',
  '꼴통',
  '싀밸',
  '싀펄',
  '사까시',
  '쉬풀',
  '개부랄',
  '대갈빡',
  '쌍넘',
  '싸이코',
  '보털',
  '자즤',
  '새캬',
  '아구창',
  '등신',
  '니어미',
  '주둥이',
  '씌밸',
  '좆',
  '개빠구리',
  '스팔',
  '싀팔',
  '새갸',
  '부랄',
  '새1끼',
  '썩을년',
  '썩을놈',
  '느그애비',
  '조옷',
  '싸카시',
  '븅삼',
  '애미뒤',
  '새키',
  '씌부랄',
  '애미터',
  '스발',
  '씌벙',
  '후레',
  '갈보',
  '발정',
  '아갈',
  '씨팔',
  '개불알',
  '개같',
  '상노무',
  '스너프',
  '씌벌',
  '싸갈통',
  '등쉰',
  '개색',
  '씌방',
  '씌팍',
  '빠구리',
  '느검마',
  '쉬팔',
  '스와핑',
  '씌발',
  '시1발',
  '개자식',
  '아가지',
  '새뤼',
  '쉬빨',
  '스왑',
  '싀벨',
  '스댕',
  '보짓',
  '빠꾸뤼',
  '개새',
  '새꺄',
  '씌퐈',
  '빠꾸리',
  '씌벨',
  '빙시',
  '씌팡',
  '쉬팡',
  '새리',
  '새끼',
  '딸따리',
  '썅늠',
  '부럴',
  '섹하자',
  '빠순이',
  '씌빨',
  '쉬뿔',
  '뽀르노',
  '뒈진다',
  '딸따뤼',
  '불알',
  'ㅅㅃ',
  'ㅅ바',
  'ㅅ발',
  'ㅅ빨',
  'ㅅ팔',
  'ㅆㅂ',
  'ㅆㅃ',
  'ㅆ바',
  'ㅆ발',
  'ㅆ빠',
  'ㅆ빨',
  'ㅆ팔',
  '쉬바',
  '쉬발',
  '쉬밤',
  '쉬밬',
  '쉬벌',
  '슈박',
  '슈발',
  '슈밤',
  '슈방',
  '슈벌',
  '스발',
  '스벌',
  '싀바',
  '싀발',
  '싀밤',
  '싀벌',
  '시박',
  '시발',
  '시밬',
  '시밯',
  '시밸',
  '시뱀',
  '시뱅',
  '시벌',
  '시벨',
  '시볼',
  '시불',
  '시빠',
  '시빡',
  '시빨',
  '시빵',
  '시뻘',
  '시뻥',
  '시파',
  '시팍',
  '시팓',
  '시팔',
  '시팽',
  '시퍽',
  '시펃',
  '시펄',
  '시펍',
  '시펒',
  '시펓',
  '시펔',
  '시펖',
  '시폽',
  '시퐄',
  '십새',
  '십파',
  '십팔',
  '싯팔',
  '쒸바',
  '쒸발',
  '쒸밤',
  '쒸방',
  '쒸벌',
  '쒸빨',
  '쓔벌',
  '쓰바',
  '쓰박',
  '쓰발',
  '쓰밬',
  '쓰벌',
  '씌바',
  '씌발',
  '씌밤',
  '씌벌',
  '씨댕',
  '씨바',
  '씨이발',
  '씨팔',
  'ㅆㅍ',
  '엿먹어',
  '엿 먹어',
  '엿1먹어',
  '미친',
  'ㅁㅊ',
  '지랄',
  '니얼굴',
  '니면상',
  '니와꾸',
  'fuck',
];

const rooms = [];

function response(room, msg, sender, isGroupChat, replier, imageDB, pakeageName, threadld) {
  if (rooms.indexOf(room) != -1) {
  }

  if (msg) {
    let arr = [];

    var a = false;

    for (var i = 0; i < words.length - 1; i++) {
      if (msg.indexOf(words[i]) != -1) {
        arr.push(words[i].replace(words[i].slice(0, 1), '*'));

        a = true;
      }
    }

    if (a) {
      var daya = new Date();

      var rh = daya.getHours();

      var rm = daya.getMinutes();

      var rs = daya.getSeconds();

      보냄.push(sender);

      FileStream.append('sdcard/채팅욕/' + sender + '.txt', '1');

      FileStream.append(
        'sdcard/채팅욕/욕내역/' + sender + '.txt',
        '\n' +
          msg +
          ' (' +
          daya.getFullYear() +
          '/' +
          (Number(daya.getMonth()) + 1) +
          '/' +
          daya.getDate() +
          ', ' +
          rh +
          ':' +
          rm +
          ':' +
          rs +
          ')'
      );

      var read = FileStream.read('sdcard/채팅욕/' + sender + '.txt').length;

      목록.push('(총 ' + read + '회) ' + sender);

      replier.reply(
        "[''" +
          sender +
          "''님의 욕설이 감지됨!]\n\n-욕 횟수: " +
          read +
          '회\n-시간: ' +
          rh +
          '시 ' +
          rm +
          '분 ' +
          rs +
          '초\n-욕 : ' +
          arr +
          '\n' +
          Ll +
          "\n욕 사용횟수 초기화하기 : ''욕초기화+띄어쓰기+(유저닉네임)''" +
          '\n' +
          Ll
      );
    }

    if (msg.indexOf('욕초기화 ') == 0) {
      if (clearOwner.indexOf(sender) != -1) {
        var deleter = msg.trim().substring(5);

        보냄 = [];

        FileStream.remove('sdcard/채팅욕/' + deleter + '.txt');

        FileStream.remove('sdcard/채팅욕/욕내역/' + deleter + '.txt');

        replier.reply("'" + deleter + "'님의 욕 사용횟수가 초기화 되었습니다.");
      } else {
        replier.reply('지정된 관리자만 욕 사용횟수를 초기화 할 수 있습니다.');
      }
    }

    if (msg == '블랙리스트') {
      if (clearOwner.indexOf(sender) != -1) {
        var lists = Array.from(new java.io.File('sdcard/채팅욕').listFiles());

        replier.reply(
          '[욕에 대한 블랙리스트 입니다]\n' + Lw + '\n' + lists.join('\n').replace(/sdcard\/채팅욕\/|\.txt/g, '')
        );
      } else {
        replier.reply('지정된 관리자만 욕 블랙리스트를 볼 수 있습니다.');
      }
    }

    try {
      if (msg.startsWith('욕횟수 ')) {
        var per = msg.trim().substring(4);

        var read2 = FileStream.read('sdcard/채팅욕/' + per + '.txt').length;

        replier.reply("[''" + per + "''님의 욕횟수 입니다]\n\n" + read2 + '회');
      }
    } catch (e) {
      replier.reply('해당 닉네임의 욕횟수를 찾을 수 없습니다.');
    }

    if (msg.startsWith('욕내역 ')) {
      try {
        var per2 = msg.trim().substring(4);

        var read3 = FileStream.read('sdcard/채팅욕/욕내역/' + per2 + '.txt');

        replier.reply("[''" + per2 + "''님의 욕내역 입니다]\n" + read3);
      } catch (e) {
        replier.reply('해당 닉네임의 욕내역을 찾을 수 없습니다.');
      }
    }
  }
}
